[
    {
        "id": "124e13b9-2d54-4b2f-a74d-a77b362d6eaa",
        "name": "Xing Hune",
        "ratings": 4.9,
        "ratingsCount": 3725,
        "numberOfRecipe": 10,
        "experience": 14,
        "img": "../assets/chefs/1.jpg",
        "recipe": [
            {
                "id": 1,
                "directions": [
                    "Poach chicken: In a 1 1/2-quart saucepan bring water to a boil with gingerroot, Scotch, and salt to taste. Add chicken and simmer, covered, 12 minutes, or until just cooked through. Transfer chicken with tongs to a bowl and chill, covered, 20 minutes.",
                    "Make sauce while chicken is cooling: In a bowl stir together sauce ingredients until sugar is dissolved.",
                    "Halve chicken and cut across grain into thin slices. Spoon sauce over chicken and sprinkle with coriander."
                ],
                "ingredients": [
                    "2 cups water",
                    "four 1/4-inch-thick slices fresh gingerroot",
                    "1/4 cup Scotch",
                    "1 whole skinless boneless chicken breast (about 3/4 pound)",
                    "1 tablespoon soy sauce",
                    "2 garlic cloves, minced",
                    "1 1/2 teaspoons rice vinegar (not seasoned)",
                    "1 1/4 teaspoons sugar",
                    "1 teaspoon Asian chili oil, or",
                    "1 teaspoon Asian sesame oil",
                    "plus Tabasco to taste",
                    "Garnish: 3 tablespoons chopped coriander sprigs",
                    "Accompaniment if desired:sesame orzo with charred scallions"
                ],
                "language": "en-US",
                "source": "www.epicurious.com",
                "tags": [
                    "Scotch",
                    "Chicken",
                    "Garlic",
                    "Ginger",
                    "Poach",
                    "Quick & Easy",
                    "Lunch",
                    "Summer",
                    "Chill",
                    "Sesame",
                    "Gourmet",
                    "Sugar Conscious",
                    "Dairy Free",
                    "Peanut Free",
                    "Tree Nut Free",
                    "Kosher"
                ],
                "title": "Cold Poached Chicken with Chinese Garlic Sauce",
                "image": "https://img.freepik.com/premium-photo/veg-chicken-manchurian-with-gravy-popular-food-india-served-bowl-with-chopstick_466689-34961.jpg?w=900"
            },
            {
                "id": 2,
                "directions": [
                    "Boil 2 cups water, star anise, ginger, and zest in a 1-quart saucepan, covered, 5 minutes, then cool infusion, uncovered, to room temperature, about 30 minutes.",
                    "Stir together kosher salt, Insta Cure, and remaining 4 cups water in storage tub until solids are dissolved, about 3 minutes, then add brown sugar, soy sauce, hoisin sauce, and cooled infusion (with solids). Add ice and stir until cure is cold (ice may not melt completely; keeping liquid cold slows salt absorption).",
                    "Add chicken to cure and weight down with a large plate (to keep submerged). Chill, tub covered with a lid or plastic wrap, 4 to 6 hours.",
                    "Rinse chicken and pat dry, then discard brine.",
                    "Open vents on bottom of grill and on lid. Remove lid and top rack from grill, then center disposable roasting pan on lower rack and add 1 1/2 cups sawdust to pan.",
                    "Light 6 charcoal briquettes in chimney starter. When briquettes are fully lit (covered completely with gray ash and glowing), transfer with tongs to sawdust, spacing evenly.",
                    "When sawdust begins to smolder, replace top rack and arrange chicken legs on rack about 1 inch apart. Cover grill with lid, then insert thermometer into a vent hole in lid to monitor air temperature, which should be 80 to 120°F. (If temperature rises above 120°F, remove 1 or more briquettes or uncover grill slightly until temperature falls. If temperature falls below 80°F or sawdust stops burning, light 1 more briquette and add to sawdust.)",
                    "Smoke chicken, adding 1 1/2 cups sawdust to roasting pan and stirring with tongs every 1 1/2 hours to ignite unburned sawdust, 6 hours. (Chicken will not be cooked.)",
                    "Put oven rack in middle of oven and preheat oven to 350°F. Lightly oil an 11- by 17-inch roasting pan. Transfer smoked chicken, skin sides up, to pan and bake until the thickest part of a thigh registers 170°F on thermometer, about 25 minutes. Cool completely, uncovered, then chill, wrapped in plastic wrap, until ready to serve."
                ],
                "ingredients": [
                    "6 cups cold water",
                    "4 whole star anise",
                    "6 (1/8-inch-thick) slices fresh ginger",
                    "1 (3- by 1/2-inch) strip fresh orange zest",
                    "1 cup kosher salt",
                    "2 1/2 tablespoons Insta Cure No. 1 (curing salt)",
                    "1/2 cup packed dark brown sugar",
                    "1/4 cup soy sauce",
                    "1/4 cup hoisin sauce",
                    "3 cups ice cubes",
                    "5 whole chicken legs (with thighs attached; 3 lb)",
                    "Special equipment: a 1- to 2-gallon plastic storage tub; a 22 1/2-inch kettle grill with a lid and a hinged top rack; a 12- by 8- by 2-inch disposable aluminum roasting pan; 6 cups hardwood sawdust (3/4 lb; not from treated wood); charcoal briquettes; a chimney starter; long metal tongs; an instant-read thermometer"
                ],
                "language": "en-US",
                "source": "www.epicurious.com",
                "tags": [
                    "Chicken",
                    "Poultry",
                    "Bake",
                    "Summer",
                    "Soy Sauce",
                    "Gourmet"
                ],
                "title": "Cold-Smoked Chicken Legs in a Chinese Cure",
                "image": "https://img.freepik.com/free-photo/top-view-asian-dumplings-dish-with-herbs_23-2148694347.jpg?w=900&t=st=1683119959~exp=1683120559~hmac=edff812fa487abd1250768667fa976342c7baf0bfff2b8fe66fe4179ea8073dd"
            },
            {
                "id": 3,
                "directions": [
                    "Cut off wing tips, reserving for another use, and halve wings at joint. Coarsely chop onion and finely chop gingerroot. In a large sealable plastic bag combine onion, gingerroot, soy sauce, Sherry, five-spice powder, sugar, and 1 teaspoon salt. Add wings and seal bag, pressing out excess air. Turn bag until wings are completely coated. Marinate chicken wings in bag in a large bowl, chilled, turning bag once, 2 hours.",
                    "Preheat oven to 350°F.",
                    "Transfer wings and marinade to a roasting pan or large shallow baking pan and bake, covered with foil, in middle of oven 1 hour. Cool wings until they can be handled and drain in a colander, discarding marinade. Wings may be prepared up to this point 1 day ahead and chilled, covered.",
                    "Reduce temperature to 250°F.",
                    "In a small serving bowl combine remaining 2 tablespoons salt and pepper. Put cornstarch in a small bowl and dredge each wing, knocking off excess cornstarch and transferring to a shallow pan. In a 5- to 6-quart heavy kettle heat oil until a deep-fat thermometer registers 370°F. Working in batches of 6 or 7, fry wings in oil until golden brown, about 3 minutes, and with a slotted spoon transfer to paper towels to drain. Keep wings warm on a baking sheet in oven. Fry remaining wings in same manner, returning oil to 370°F. between batches.",
                    "Serve wings with salt and pepper mixture."
                ],
                "ingredients": [
                    "3 pounds chicken wings (12 to 14)",
                    "1 onion",
                    "a 1 1/2-inch piece peeled fresh gingerroot",
                    "2 tablespoons soy sauce (preferably Kikkoman)",
                    "1‚ tablespoons medium-dry Sherry",
                    "1 tablespoon Chinese five-spice powder",
                    "1 tablespoon sugar",
                    "2 tablespoons plus 1 teaspoon coarse salt",
                    "2 teaspoons freshly ground black pepper, or to taste",
                    "1/2 cup cornstarch",
                    "6 cups vegetable oil"
                ],
                "language": "en-US",
                "source": "www.epicurious.com",
                "tags": [
                    "Chicken",
                    "Appetizer",
                    "Braise",
                    "Fry",
                    "Marinate",
                    "Cocktail Party",
                    "Super Bowl",
                    "Poker/Game Night",
                    "Party",
                    "Gourmet"
                ],
                "title": "Fried Chinese Five-Spice Chicken Wings",
                "image": "https://img.freepik.com/premium-photo/stir-fry-soba-noodles-with-chicken-vegetables-old-rustic-wok-pan-chopsticks-black-stone-background-close-up-top-view-traditional-asian-thai-meal-space-text_92134-1680.jpg?w=900"
            },
            {
                "id":4,
                "directions": [
                    "Cut off 1 1/2 inches from bottom of eggplant and discard. Move knife 1/4 inch from cut side and cut almost but not all the way through eggplant (this is the pocket). Move knife 1/4 inch from pocket cut and cut slice free from eggplant. Make 7 more slices with pockets in same manner.",
                    "Stir together pork, scallion, ginger, soy sauce, and salt in a bowl with a fork. Spread 1 tablespoon filling in each eggplant pocket.",
                    "Heat 1/2 inch oil in a 10-inch heavy skillet over moderate heat until it registers 360°F on thermometer (see cooks' note, below).",
                    "Meanwhile, whisk together flour, egg, and water in a bowl until batter is smooth. Dip 4 eggplant slices, 1 at a time, into batter, shaking off excess to leave a thin coating, and fry, turning over once, until eggplant is tender when pierced with a fork and batter is pale golden, 4 to 5 minutes total. Transfer to paper towels to drain. Return oil to 360°F, then coat and fry remaining 4 slices in same manner. Drain briefly on paper towels and serve immediately."
                ],
                "ingredients": [
                    "1 (9-inch) eggplant (about 3 inches wide; 1 1/4 lb)",
                    "1/4 lb ground pork (not lean)",
                    "2 tablespoons finely chopped scallion greens",
                    "1 teaspoon minced peeled fresh ginger",
                    "1 1/2 tablespoons soy sauce",
                    "1/4 teaspoon salt",
                    "3 to 4 cups peanut or vegetable oil for frying",
                    "1 cup all-purpose flour",
                    "1 large egg, lightly beaten",
                    "3/4 cup water",
                    "Special equipment: a deep-fat thermometer"
                ],
                "language": "en-US",
                "source": "www.epicurious.com",
                "tags": [
                    "Pork",
                    "Vegetable",
                    "Appetizer",
                    "Side",
                    "Fry",
                    "Eggplant",
                    "Deep-Fry",
                    "Gourmet",
                    "Dairy Free",
                    "Tree Nut Free",
                    "No Sugar Added"
                ],
                "title": "Fried Stuffed Chinese Eggplant",
                "image": "https://img.freepik.com/free-photo/thai-northern-style-curried-noodle-soup-with-chicken-khao-soi-kai_1150-41812.jpg?w=900&t=st=1683119970~exp=1683120570~hmac=ce8f9f6888d15c894387f1d4c71f9e6b579dcce47d827c9582f52c7ff9d6648b"
            },
            {
                "id":5,
                "directions": [
                    "Whisk wine, soy sauce, garlic, and 1 teaspoon dry mustard in large glass baking dish. Add tri-tip and turn to coat with marinade. Let stand at room temperature 30 minutes, turning meat occasionally.",
                    "Meanwhile, whisk honey, 2 tablespoons water, 1/4 teaspoon salt, and remaining 2 tablespoons dry mustard in small bowl to blend; set sauce aside.",
                    "Preheat oven to 450°F. Remove tri-tip from marinade; pat dry with paper towels. Place tri-tip on large rimmed baking sheet; sprinkle with salt and pepper. Arrange green onions and mushrooms around meat; drizzle onions and mushrooms with olive oil. Roast 12 minutes. Turn meat, onions, and mushrooms over; roast until vegetables are tender and instant-read thermometer inserted into center of meat registers 125°F for medium-rare, about 12 minutes longer.",
                    "Place mushrooms and green onions on platter. Cut meat into 1/4-inch-thick slices; arrange atop green onions and mushrooms. Pour any pan juices over. Drizzle lightly with mustard sauce. Serve, passing remaining mustard sauce alongside."
                ],
                "ingredients": [
                    "1/3 cup dry red wine",
                    "2 tablespoons soy sauce",
                    "3 garlic gloves, minced",
                    "1 teaspoon plus 2 tablespoons dry mustard",
                    "1 1 1/2-pound beef tri-tip roast",
                    "2 tablespoons honey",
                    "2 tablespoons water",
                    "1/4 teaspoon salt",
                    "3 bunches green onions, root ends trimmed, dark green tops cut off and discarded",
                    "1 pound or three 6-ounce packages baby portobello mushrooms",
                    "2 tablespoons olive oil"
                ],
                "language": "en-US",
                "source": "www.epicurious.com",
                "tags": [
                    "Beef",
                    "Garlic",
                    "Mushroom",
                    "Mustard",
                    "Onion",
                    "Roast",
                    "Father's Day",
                    "Dinner",
                    "Dairy Free",
                    "Peanut Free",
                    "Tree Nut Free"
                ],
                "title": "Marinated Tri-Tip with Chinese Mustard Sauce and Roasted Green Onions and Mushrooms",
                "image": "https://img.freepik.com/free-photo/udon-noodles-with-chicken-peppers-japanese-cuisine_2829-11266.jpg?w=900&t=st=1683119983~exp=1683120583~hmac=4920b79a558fa62b01a2a290ef8a60472c0d5a09494f4bca9106b2e898982628"
            },
            {
                "id": 6,
                "directions": [
                    "Combine the cucumbers and onions in a medium bowl and salt them generously. They should be as salty as you want your final pickles—about as salty as a potato chip. Add the garlic, dill, and spices and toss to mix. Cover the bowl tightly with plastic wrap and refrigerate overnight.",
                    "The next day, drain off any liquid that has leached out of the onions and cucumbers. Douse the vegetables with the white vinegar and marinate, covered, for 3 to 4 hours in the fridge.",
                    "Drain off the vinegar and store the pickles, covered, in the fridge. They’ll last for a week. Add more chopped dill before serving."
                ],
                "ingredients": [
                    "1 pound Persian or Kirby cucumbers, cut into 1/4-inch-thick coins",
                    "1/2 white onion, sliced (about 2/3 cup)",
                    "About 1 tablespoon kosher salt",
                    "1 garlic clove, minced",
                    "2 sprigs fresh dill, leaves picked and chopped, plus additional for garnish",
                    "1 1/2 teaspoons whole black peppercorns",
                    "1 1/2 teaspoons fennel seeds",
                    "1 teaspoon red pepper flakes",
                    "1 cup distilled white vinegar"
                ],
                "language": "en-US",
                "source": "www.epicurious.com",
                "tags": [
                    "HarperCollins",
                    "Pickles",
                    "Cucumber",
                    "Spice",
                    "Onion",
                    "Dill",
                    "Vinegar"
                ],
                "title": "Dill Pickles",
                "image": "https://img.freepik.com/premium-photo/chinese-food-dark-background-chinese-noodles-rice-dumplings-peking-duck-dim-sum-spring-rolls_92134-376.jpg?w=900"
            },
            {
                "id":7,
                "directions": [
                    "Rinse the tofu, then cut crosswise into 6 slices. Put slices between several layers of paper towels and let drain while making the sauce. (You’ll likely have to replace the paper towels at least once.)",
                    "Prep the seasonings for the sauce: Peel the garlic cloves and the ginger, then quarter the ginger. Turn on your food processor and drop the garlic and ginger through the feed tube; they’ll be minced in no time. Stop the machine and the black beans in a small sieve until the water runs clear. Add them to the food processor and pulse until coarsely chopped.",
                    "For the liquid portion of the sauce, stir together the water, soy sauce, Sherry, maple syrup, vinegar, and the cornstarch until the cornstarch is evenly suspended. Now you’re ready to cook the sauce!",
                    "Generously film the bottom of a heavy 2-quart saucepan with the vegetable oil and heat over moderately high heat until hot but not smoking. Stir-fry the seasonings until fragrant, less than a minute. Stir the cornstarch mixture and add it to the pan. Whisk the sauce occasionally while bringing it to a boil and simmer 1 minute. Then set the sauce aside while you fry the tofu.",
                    "Generously film the bottom of a 12-inch nonstick skillet with vegetable oil and heat over high heat until hot but not smoking. Blot up any excess moisture on the tofu with a paper towel before laying in the skillet. Fry the slices on all sides (forgo the short ends), turning them only when the undersides are golden and crisp, 5 to 8 minutes total. (You may need to lower the heat as the frying progresses.) Give the tofu one last flip on a paper towel to sop up any stray oil and reheat the sauce.",
                    "Serve with rice and broccoli, pouring sauce over all."
                ],
                "ingredients": [
                    "1-pound block of extra-firm tofu",
                    "4 garlic cloves",
                    "1-inch chunk of fresh ginger",
                    "2 tablespoons Chinese fermented black beans",
                    "11/2 cups water",
                    "4 tablespoons soy sauce",
                    "3 tablespoons Sherry (dry or sweet)",
                    "1 tablespoon maple syrup",
                    "2 teaspoons cider vinegar",
                    "1 1/2 tablespoons cornstarch",
                    "vegetable oil"
                ],
                "language": "en-US",
                "source": "www.epicurious.com",
                "tags": [
                    "Bean",
                    "Garlic",
                    "Ginger",
                    "Vegetarian",
                    "Tofu",
                    "Pan-Fry",
                    "Gourmet"
                ],
                "title": "Panfried Tofu with Chinese Black Bean Sauce",
                "image": "https://img.freepik.com/free-photo/stir-fry-with-chicken-eggplant-boiled-rice_2829-11049.jpg?w=900&t=st=1683120007~exp=1683120607~hmac=cd2665ff8703870f3b4d7a32eb06b8fe71048232486617878a20b3eb6a39f11d"
            },
            {
                "id":8,
                "directions": [
                    "In a bowl whisk together the scallion, the soy sauce, the vinegar, the gingerroot, the vegetable oil, 1 tablespoon of the sesame oil, the sugar, the garlic paste, the red pepper flakes, and salt and pepper to taste. In a shallow dish arrange the scrod fillets in one layer, pour the soy sauce mixture over them, and let the fish marinate, covered and chilled, for 30 minutes.",
                    "Put a bamboo steamer in a wok and add enough water to the wok to allow the bottom rim of the steamer to sit in the water but the tray to remain above it. (Alternatively, arrange a steamer rack in a wide deep kettle and add water to the kettle to reach just below the steamer rack.) Bring the water to a boil. Line the steamer with the cabbage or with a plate, such as a glass pie plate, at least 1 inch smaller in diameter than the steamer, arrange the fillets, folded into thirds, skinned sides up and seam sides down, on the cabbage, and pour the marinade evenly over them. Steam the fish, covered, over the boiling water for 8 to 12 minutes, or until it just flakes, and with oven mitts remove the steamer from the wok. Transfer the fillets carefully to a heated platter and drizzle them with the remaining 1 teaspoon sesame oil."
                ],
                "ingredients": [
                    "1/2 cup thinly sliced scallion",
                    "1/4 cup soy sauce",
                    "2 tablespoons rice-wine vinegar (available at Oriental markets) or white-wine vinegar",
                    "a 1 1/2-inch piece of peeled fresh gingerroot, cut into very fine julienne strips",
                    "2 tablespoons vegetable oil",
                    "1 tablespoon Oriental sesame oil plus 1 teaspoon for drizzling the fish",
                    "2 teaspoons sugar",
                    "2 garlic cloves, minced and mashed to a paste with a pinch of salt",
                    "1/4 to 1/2 teaspoon dried hot red pepper flakes, or to taste",
                    "six 6-ounce scrod fillets",
                    "cabbage or romaine leaves for lining the steamer if desired"
                ],
                "language": "en-US",
                "source": "www.epicurious.com",
                "tags": [
                    "Wok",
                    "Fish",
                    "Ginger",
                    "Marinate",
                    "Steam",
                    "Chill",
                    "Gourmet"
                ],
                "title": "Steamed Scrod Fillets Chinese Style",
                "image": "https://img.freepik.com/premium-photo/cooked-instant-noodles-bowl-with-chopsticks-close-up-wooden-table_43518-159.jpg?w=900"
            }

        ]
    },
    {
        "id": "124e13b9-2d54-4b2f-a74d-a77b362d6eab",
        "name": "Ming Manchu",
        "numberOfRecipe": 7,
        "ratings": 4.3,
        "ratingsCount": 2225,
        "experience": 10,
        "img": "../assets/chefs/2.jpg",
        "recipe":
        [
            {
                "id":1,
                "directions": [
                    "Cover rice with cold water by 1 inch in a bowl and soak at least 4 and up to 12 hours.",
                    "After rice has soaked at least 3 hours, fill wok with enough water for bottom rim of steamer (not rack) to rest in water, then bring to a boil.",
                    "Put scallops and rice wine in a small heatproof bowl. Put bowl with scallops in bottom tier of steamer and steam, covered, until soft, about 2 hours. (Replenish water as necessary to keep bottom rim of steamer in water to prevent scorching.)",
                    "When scallops have steamed for almost 1 hour, line bottom and side of top tier of steamer with several layers of cheesecloth, then set tier onto steamer in wok.",
                    "Drain rice in a sieve and rinse well under cold running water, then spread rice in an even layer over cheesecloth in steamer (cheesecloth should not hang over edge of steamer) and steam, covered, sprinkling rice with a few drops of water occasionally, 1 hour. (Replenish water as necessary to keep bottom rim of steamer in water to prevent scorching.)",
                    "Meanwhile, soak mushrooms in 2 cups boiling-hot water in a bowl (water should cover mushrooms), turning mushrooms over occasionally, until softened, about 30 minutes. Cut out and discard stems from mushrooms, then squeeze excess liquid from caps into bowl and thinly slice caps. Reserve 1/2 cup mushroom- soaking liquid and discard remainder.",
                    "Remove top tier of steamer from wok and transfer rice from cheesecloth to a platter. Once rice has cooled, lightly wet your hands and break up large clumps.",
                    "Using tongs, remove bowl containing scallops from bottom tier of steamer. Reserve water in wok.",
                    "Reserve scallop-soaking liquid and shred scallops into \"threads\" with a fork or your fingers, discarding tough muscle on side (muscle will remain solid but scallop meat will shred easily).",
                    "Bring water in wok to a boil, then arrange sausages on a heatproof plate and steam in steamer, covered, 5 minutes. When cool enough to handle, halve sausages lengthwise, then cut diagonally into 1/4-inch-thick slices.",
                    "Cut scallions into 1/4-inch-thick slices, keeping pale green and white parts separate from dark green parts.",
                    "Stir together oyster sauce, soy sauce, sugar, and salt in a bowl until sugar is dissolved.",
                    "Pour off water from wok and dry. Heat wok over high heat until a bead of water vaporizes within 1 to 2 seconds of contact. Pour peanut oil down side of wok, then swirl oil, tilting wok to coat sides. Add mushrooms and pale green and white parts of scallions and stir-fry 1 minute. Add sausage and scallops and stir-fry 1 minute. Add rice and stir-fry, breaking up any clumps, 1 minute. Add scallop- and mushroom-soaking liquids along with oyster sauce mixture and stir-fry until rice is well coated and hot, about 2 minutes. Add sesame oil, then add pepper and remaining scallion greens and stir-fry until combined well."
                ],
                "ingredients": [
                    "2 1/2 cups Chinese or Japanese short-grain sticky (\"sweet\") rice",
                    "6 to 8 (1-inch-wide) large dried scallops",
                    "1/2 cup Chinese rice wine such as Shaoxing or medium-dry Sherry",
                    "12 to 15 Chinese dried black mushrooms",
                    "4 links Cantonese sweet sausage",
                    "2 bunches of scallions",
                    "1/4 cup oyster sauce (preferably premium)",
                    "2 tablespoons light soy sauce",
                    "1 tablespoon sugar",
                    "1 teaspoon kosher salt",
                    "1/4 cup peanut oil",
                    "2 tablespoons Asian sesame oil",
                    "2 teaspoons black pepper",
                    "Special equipment: a well-seasoned 14-inch wok, preferably flat-bottomed; a 10-inch bamboo steamer with 2 tiers; cheesecloth"
                ],
                "language": "en-US",
                "source": "www.epicurious.com",
                "tags": [
                    "Wok",
                    "Pork",
                    "Rice",
                    "Shellfish",
                    "Side",
                    "Steam",
                    "Stir-Fry",
                    "Sausage",
                    "Scallop",
                    "Gourmet",
                    "Sugar Conscious",
                    "Dairy Free",
                    "Tree Nut Free"
                ],
                "title": "Sticky Rice with Chinese Sausage and Dried Scallops",
                "image": "https://img.freepik.com/free-photo/flat-lay-noodles-with-vegetables-chicken_23-2148377422.jpg?w=900&t=st=1683119663~exp=1683120263~hmac=896d5738098098a4b629e6860ea49bd8bc23dd0a6b1cfd1b010877ba8c388584"
            },
            {
                "id":2,
                "directions": [
                    "Cut the beef across the grain into 1/4-inch slices. In a bowl, combine 2 Tbs. of the tamari and 3/4 tsp. of the sugar and stir to dissolve. Mix in half of the green onions, 1 1/2 tsp. of the sesame oil and a generous amount of black pepper. Add the beef and stir to coat. Set aside.",
                    "In a food processor, combine the peanut butter, ginger, vinegar, red pepper flakes, the remaining 3 Tbs. tamari, the remaining green onions, 1 Tbs. of the sesame oil and the remaining 1 tsp. sugar. Add the hot water and process until well blended to make a sauce.",
                    "Meanwhile, bring a large pot of salted water to a boil over high heat. Add the spaghetti and stir well. Cook, stirring frequently, until al dente, about 8 minutes. Drain, rinse briefly with cold water and drain well. Place in a warmed bowl. Add the remaining 1 Tbs. sesame oil and stir to coat. Stir in the bell pepper and sauce to taste. Stir to coat the noodles, then season with salt and black pepper.",
                    "In a large, heavy fry pan over high heat, warm the vegetable oil. Working in batches, sear the beef in a single layer, about 20 seconds per side. Transfer to a cutting board and cut each piece in half lengthwise. Divide the noodles among 4 bowls, top with the beef and sprinkle with the cilantro. Serve immediately. Serves 4.",
                    "Adapted from Williams-Sonoma",
                    "Weeknight Gluten Free,",
                    "by Kristine Kidd (Weldon Owen, 2013)."
                ],
                "ingredients": [
                    "3/4 lb. boneless beef top sirloin, trimmed, halved lengthwise\n  and partially frozen",
                    "5 Tbs. gluten-free tamari",
                    "1 3/4 tsp. sugar",
                    "4 green onions, minced",
                    "1 1/2 tsp. plus 2 Tbs. Asian sesame oil",
                    "Freshly ground black pepper, to taste",
                    "1/3 cup creamy old fashioned-style peanut butter",
                    "2 Tbs. minced fresh ginger",
                    "2 Tbs. balsamic vinegar",
                    "1/2 tsp. red pepper flakes",
                    "1/4 cup hot water",
                    "Kosher salt, to taste",
                    "10 oz. gluten-free spaghetti, such as Schar",
                    "1 large red bell pepper, halved lengthwise and seeded, then\n  halved crosswise and cut into very thin slices",
                    "1 Tbs. vegetable oil",
                    "1/4 cup chopped fresh cilantro"
                ],
                "language": "en-US",
                "source": "www.williams-sonoma.com",
                "tags": [],
                "title": "Chinese-Style Peanut Noodles with Seared Beef",
                "image": "https://img.freepik.com/free-photo/beef-vegetables-sesame-seeds-black-bowl-black-slate-background_123827-20598.jpg?w=900&t=st=1683120950~exp=1683121550~hmac=eefb4ad693d97225666b908548ddf7f420f6789a1ade5a95bbca5bde2ec7c098"
            },
            {
                "id":3,
                "directions": [
                    "Preheat the oven to 350 degrees F.",
                    "Place the chicken breasts on a sheet pan and rub with the skin with olive oil. Sprinkle liberally with salt and pepper. Roast for 35 to 40 minutes, until the chicken is just cooked. Set aside until cool enough to handle. Remove the meat from the bones, discard the skin, and shred the chicken in large bite-sized pieces.",
                    "Blanch the asparagus in a pot of boiling salted water for 3 to 5 minutes until crisp-tender. Plunge into ice water to stop the cooking. Drain. Cut the peppers in strips about the size of the asparagus pieces. Combine the cut chicken, asparagus, and peppers in a large bowl.",
                    "Whisk together all of the ingredients for the dressing and pour over the chicken and vegetables. Add the scallions and sesame seeds and season to taste. Serve cold or at room temperature."
                ],
                "ingredients": [
                    "4 split chicken breasts (bone-in, skin-on)",
                    "Good olive oil",
                    "Kosher salt",
                    "Freshly ground black pepper",
                    "1/2 pound asparagus, ends removed, and cut in thirds diagonally",
                    "1 red bell pepper, cored and seeded",
                    "2 scallions (white and green parts), sliced diagonally",
                    "1 tablespoon white sesame seeds, toasted",
                    "1/2 cup vegetable oil",
                    "1/4 cup good apple cider vinegar",
                    "3 tablespoons soy sauce",
                    "1 1/2 tablespoons dark sesame oil",
                    "1/2 tablespoon honey",
                    "1 clove garlic, minced",
                    "1/2 teaspoon peeled, grated fresh ginger",
                    "1/2 tablespoon sesame seeds, toasted",
                    "1/4 cup smooth peanut butter",
                    "2 teaspoons kosher salt",
                    "1/2 teaspoon freshly ground black pepper"
                ],
                "language": "en-US",
                "source": "www.foodnetwork.com",
                "tags": [
                    "Easy Chicken Recipes",
                    "Chicken",
                    "Easy Recipes",
                    "Poultry Recipes",
                    "Easy Main Dish Recipes",
                    "Main Dish Recipes",
                    "Easy Lunch Recipes",
                    "Lunch",
                    "Roasted Chicken",
                    "Roasting",
                    "Asian",
                    "Chinese Recipes",
                    "Chicken Salad",
                    "Salad Recipes",
                    "Peanut Butter Fudge",
                    "Asparagus",
                    "Vegetable",
                    "Apple",
                    "Fruit",
                    "Spring"
                ],
                "title": "Chinese Chicken Salad",
                "image": "https://img.freepik.com/free-photo/top-view-delicious-noodles-concept_23-2148773777.jpg?w=900&t=st=1683120961~exp=1683121561~hmac=b82c7500a449d46ccba4930a7d32fc7ec4b3e7b73a701a72232fe1f3c1d6df82"
            }
        ]
    },
    {
        "id": "124e13b9-2d54-4b2f-a74d-a77b362d6eac",
        "name": "Lim Longwei",
        "experience":12,
        "ratings": 4.5,
        "ratingsCount": 1724,
        "numberOfRecipe": 20,
        
        "img": "../assets/chefs/3.jpg",
        "recipe":
        [
            {
                "id":1,
                "directions": [
                    "In a bowl, mash the yellow curry paste with about 2 tablespoons of chicken broth to help dissolve the paste; whisk in remaining chicken broth, sugar, curry powder, salt, light soy sauce, and coconut milk. Set aside.",
                    "Heat a wok or large skillet over high heat for about 30 seconds; pour in the oil. Let the oil heat until shimmering, about 30 more seconds. Stir the chicken, garlic, and ginger into the hot oil; cook and stir until the chicken has begun to brown and the garlic and ginger are fragrant, about 2 minutes. Stir in the onion and potatoes, toss all ingredients in the hot oil, and pour in the sauce mixture. Bring the sauce to a boil, reduce heat, and cover the wok. Simmer until the chicken is cooked through and the potatoes are tender, 20 to 25 minutes."
                ],
                "ingredients": [
                    "1 tablespoon yellow curry paste",
                    "1/2 cup chicken broth, divided",
                    "1 teaspoon white sugar",
                    "1 1/2 teaspoons curry powder",
                    "1/2 teaspoon salt",
                    "4 1/2 teaspoons light soy sauce",
                    "1 (5.6 ounce) can coconut milk",
                    "1 tablespoon canola oil",
                    "3 skinless, boneless chicken breast halves, sliced",
                    "2 teaspoons minced garlic",
                    "1 teaspoon minced fresh ginger",
                    "1 onion, sliced",
                    "2 potatoes - peeled, halved, and sliced"
                ],
                "language": "en-US",
                "source": "allrecipes.com",
                "tags": [],
                "title": "Adriel's Chinese Curry Chicken",
                "img": "https://img.freepik.com/free-photo/top-view-delicious-noodles-concept_23-2148773775.jpg?w=900&t=st=1683119500~exp=1683120100~hmac=182c9feec861ede801b7839eb397df5044da4f673d7c40433b9ab49952b16a7e"
            },
            {
                "directions": [
                    "Heat 1 teaspoon vegetable oil in a wok or large skillet over medium heat. Pour in beaten eggs and cook, without stirring, until firmed. Flip the eggs over and cook for an additional 20 seconds to firm the other side. Set egg pancake aside to cool, then slice into thin strips.",
                    "Heat the remaining vegetable oil in a wok or large skillet over high heat. Stir in cabbage and carrot; cook for 2 minutes to wilt. Add bamboo, mushroom, pork, green onions, soy sauce, salt, sugar, and MSG; continue cooking until the vegetables soften, about 6 minutes. Stir in sliced egg, then spread mixture out onto a pan, and refrigerate until cold, about 1 hour.",
                    "To assemble the egg rolls, place a wrapper onto your work surface with one corner pointing towards you. Place about 3 tablespoons of cooled filling in a heap onto the bottom third of the wrapper. Brush a little beaten egg white onto the top two edges of the wrapper, then fold the bottom corner over the filling and roll firmly to the halfway point. Fold the left and right sides snugly over the egg roll, then continue rolling until the top corners seal the egg roll with the egg white. Repeat with remaining egg roll wrappers, covering finished egg rolls with plastic wrap to keep from drying out.",
                    "Heat about 6-inches of oil in a wok or deep-fryer to 350 degrees F (175 degrees C).",
                    "Fry egg rolls 3 or 4 at a time until golden brown, 5 to 7 minutes. Drain on paper towels."
                ],
                "ingredients": [
                    "4 teaspoons vegetable oil",
                    "3 eggs, beaten",
                    "1 medium head cabbage, finely shredded",
                    "1/2 carrot, julienned",
                    "1 (8 ounce) can shredded bamboo shoots",
                    "1 cup dried, shredded wood ear mushroom, rehydrated",
                    "1 pound Chinese barbequed or roasted pork, cut into matchsticks",
                    "2 green onions, thinly sliced",
                    "2 1/2 teaspoons soy sauce",
                    "1 teaspoon salt",
                    "1 teaspoon sugar",
                    "1/2 teaspoon monosodium glutamate (MSG)",
                    "1 (14 ounce) package egg roll wrappers",
                    "1 egg white, beaten",
                    "4 cups oil for frying, or as needed"
                ],
                "language": "en-US",
                "source": "allrecipes.com",
                "tags": [],
                "title": "Authentic Chinese Egg Rolls (from a Chinese person)",
                "image": "https://img.freepik.com/free-photo/top-view-delicious-noodles-concept_23-2148773780.jpg?w=900&t=st=1683119654~exp=1683120254~hmac=5e6c7987da762ff394d65d6b5539f615641131e7375cb8c46c6c2ebf1f528edc"
            },
            {
                "id":2,
                "directions": [
                    "Fill a large pot 1/2 full with water and place a bamboo steamer with lid on top of the pot. Bring to a rolling boil. Scrub the scales off of the fish and rinse with cold water. Place the fish onto a small metal plate, belly side down.",
                    "Place into the steamer and cover. Cook until the fish is no longer opaque and flakes easily, 10 to 12 minutes. Try not to take the lid off the pot until it is done steaming; this will ensure a fully-cooked and tender fish.",
                    "While the fish is steaming, combine the vegetable oil, green onions, and ginger in a small saucepan. Cook over medium-high heat until the ginger bubbles. Carefully pour the hot oil over the steamed fish. Drizzle with soy sauce to serve."
                ],
                "ingredients": [
                    "1 (4 pound) whole rockfish, dressed",
                    "1/4 cup vegetable oil",
                    "1 green onion, thinly sliced diagonally",
                    "1 (1 inch) piece fresh ginger, peeled and cut into matchstick strips",
                    "1/2 cup soy sauce"
                ],
                "language": "en-US",
                "source": "allrecipes.com",
                "tags": [],
                "title": "Authentic Chinese Steamed Fish",
                "image": "https://img.freepik.com/free-photo/high-angle-traditional-asian-meal-with-chopsticks_23-2148694371.jpg?w=900&t=st=1683119545~exp=1683120145~hmac=d09b529140bc6fc8ed00b53c842000c0db0f3edf575606f8026ac41c73b13aba"
            },
            {
                "id":3,
                "directions": [
                    "Pour beef broth, tomato juice, and soy sauce into a large saucepan. Stir in brown sugar, applesauce, and celery; season with ginger and chili powder. Bring to a boil, then reduce heat to medium-low and simmer 20 minutes. Ladle into serving bowls and garnish with green onions and shrimp chips."
                ],
                "ingredients": [
                    "1 quart beef broth",
                    "2 cups tomato juice",
                    "1 tablespoon soy sauce",
                    "2 tablespoons brown sugar",
                    "1/2 cup applesauce",
                    "2 stalks celery, thinly sliced",
                    "1 teaspoon ground ginger",
                    "1/4 teaspoon chili powder",
                    "1 green onion, thinly sliced",
                    "1 cup shrimp chips (prawn crackers)"
                ],
                "language": "en-US",
                "source": "allrecipes.com",
                "tags": [],
                "title": "Chinese Tomato Soup: Dutch-Style",
                "image": "https://img.freepik.com/free-photo/asian-dish-plate-with-chopsticks-vegetables_23-2148694376.jpg?w=900&t=st=1683119874~exp=1683120474~hmac=b80098293def9d7d44762a8248dbc9d7ff2117835ff18385ffccbd03bcfd6291"
            }

        ]
    },
    {
        "id": "124e13b9-2d54-4b2f-a74d-a77b362d6ead",
        "name": "Lee Kong",
        "experience":7,
        "ratings": 4,
        "ratingsCount": 3725,
        "numberOfRecipe":12,
        "img": "../assets/chefs/4.jpg",
        "recipe":
        [
            {
                "id":1,
                "directions": [
                    "In a large bowl, mix together beef, cabbage, carrot, and onion. Stir in the egg, sugar, salt, soy sauce, and vegetable oil.",
                    "Place a large teaspoonful of filling in the center of a dumpling skin. Moisten the edges of a wonton with a few drops of water. Then fold the dumpling in half, and pinch the edges together to seal. Create a ripple pattern along the pinched edge by pinching and gently pushing together small segments of it. Repeat with remaining dumplings.",
                    "Boil the dumplings in water until they float to the top, about 5 minutes."
                ],
                "ingredients": [
                    "1 1/2 pounds ground beef",
                    "2 cups shredded Chinese cabbage",
                    "1 carrot, shredded",
                    "1 onion, minced",
                    "1 egg",
                    "1 teaspoon sugar",
                    "1 teaspoon salt",
                    "1 tablespoon soy sauce",
                    "1 tablespoon vegetable oil",
                    "1 (14 ounce) package wonton wrappers"
                ],
                "language": "en-US",
                "source": "allrecipes.com",
                "tags": [],
                "title": "Beefy Chinese Dumplings",
                "image": "https://img.freepik.com/free-photo/top-view-asian-dish-with-chopsticks-copy-space_23-2148694382.jpg?w=1060&t=st=1683119881~exp=1683120481~hmac=1fb679af8c54a7d36402ceb5c16094a4b9a9b48f4cb6e85a2c69c206a7e08b5f"
            },
            {
                "id":2,
                "directions": [
                    "Preheat oven to 350 degrees F (175 degrees C). Prepare a casserole dish with cooking spray.",
                    "Heat olive oil in a saucepan over medium heat; cook and stir onion in the hot oil until translucent, 5 to 7 minutes. Add soup and water; stir. Season the mixture with garlic salt and pepper.",
                    "Layer chicken into the bottom of the prepared casserole dish; top with chow mein noodles and pimentos. Pour the mixture from the saucepan over the layers to cover.",
                    "Bake in preheated oven until completely heated through, 20 to 30 minutes."
                ],
                "ingredients": [
                    "cooking spray",
                    "1 tablespoon olive oil",
                    "1 small onion, diced",
                    "1 (10.75 ounce) can low-fat cream of mushroom soup",
                    "1 (10.75 ounce) can water",
                    "1/4 teaspoon garlic salt, or to taste",
                    "ground black pepper to taste",
                    "1 roasted chicken, bones and skin removed, meat cut into cubes",
                    "1 (8.5 ounce) package chow mein noodles",
                    "1 (4 ounce) jar pimentos"
                ],
                "language": "en-US",
                "source": "allrecipes.com",
                "tags": [],
                "title": "Chicken and Chinese Noodles Casserole",
                "image": "https://img.freepik.com/premium-photo/stir-fry-egg-noodles-with-chicken-sweet-paprika-mushrooms-chives-sesame-seeds-bowl-asian-cuisine-dish-white-table-background-top-view_630207-7790.jpg?w=1060"
            },
            {
                "id":3,
                "directions": [
                    "Combine the chicken, oyster sauce, and soy sauce in a mixing bowl until the chicken is evenly coated with the sauce; set aside.",
                    "Heat the vegetable oil in a wok or large skillet over high heat. Stir in the garlic and onion; cook and stir until the onion is limp, about 1 minute. Add the chicken and marinade. Cook and stir until the chicken has browned and is no longer pink, about 10 minutes.",
                    "Pour in 1/2 cup of water; season with pepper and sugar. Add the water chestnuts, snow peas, and broccoli. Cover; boil until the vegetables are just tender, about 5 minutes. Dissolve the cornstarch in 1/4 cup of water. Stir into the boiling mixture; cook until thick and no longer cloudy."
                ],
                "ingredients": [
                    "14 ounces skinless, boneless chicken breast meat - cut into bite-size pieces",
                    "1/2 cup oyster sauce",
                    "2 tablespoons soy sauce",
                    "3 tablespoons vegetable oil",
                    "2 cloves garlic, minced",
                    "1 large onion, chopped",
                    "1/2 cup water",
                    "1 teaspoon ground black pepper",
                    "1 teaspoon white sugar",
                    "1 (8 ounce) can sliced water chestnuts, drained",
                    "1 cup snow peas",
                    "1 small head broccoli, cut into florets",
                    "3 tablespoons cornstarch",
                    "1/4 cup water"
                ],
                "language": "en-US",
                "source": "allrecipes.com",
                "tags": [],
                "title": "Chicken and Chinese Vegetable Stir-Fry",
                "image": "https://img.freepik.com/premium-photo/schezwan-noodles-vegetable-hakka-noodles-chow-mein-is-popular-indo-chinese-recipes-served-bowl-plate-with-wooden-chopsticks_466689-46285.jpg?w=900"
            }
        ]
    },
    {
        "id": "124e13b9-2d54-4b2f-a74d-a77b362d6eae",
        "name": "Hong Fa",
        "experience":7,
        "ratings": 4,
        "ratingsCount": 3725,
        "numberOfRecipe":12,
        "img": "../assets/chefs/5.jpg",
        "recipe":
        [
            {
                "id":1,
                "directions": [
                    "Sift flour, sugar, salt and baking powder together in a large bowl.  Using pastry blender or knives, cut in butter until mixture resembles coarse cornmeal.",
                    "Beat the egg together with 2 tablespoons of the water and the almond extract.  Add this to the flour mixture and mix with a fork until dough leaves the sides of the bowl.",
                    "On a lightly floured surface, knead the dough until it is smooth. Wrap it in foil or cling-wrap and refrigerate for one hour.",
                    "Meanwhile, preheat oven to 350 degrees F (175 degrees C).",
                    "Form dough into 1 inch balls and place them 3 inch apart on ungreased cookie sheets.  Flatten each cookie to about 1/4 inch thick and press an almond into the center of each.  Beat egg yolk with 1 tablespoon water and brush on cookies.",
                    "Bake 20-25 minutes or until golden brown. Remove to wire rack to cool."
                ],
                "ingredients": [
                    "2 1/2 cups sifted all-purpose flour",
                    "3/4 cup white sugar",
                    "1/4 teaspoon salt",
                    "1 teaspoon baking powder",
                    "3/4 cup butter, softened",
                    "1 egg",
                    "3 tablespoons water",
                    "1 teaspoon almond extract",
                    "36 blanched almonds",
                    "1 egg yolk"
                ],
                "language": "en-US",
                "source": "allrecipes.com",
                "tags": [],
                "title": "Chinese Almond Cakes",
                "image": "https://img.freepik.com/free-photo/delicious-vietnamese-food-including-pho-ga-noodles-spring-rolls-white-table_181624-34062.jpg?w=900&t=st=1683119582~exp=1683120182~hmac=ea3dfe5bea75eb21afc2fde6168eedbc09b8686ef7183e6bc9b9b9f65344f433"
            },
            {
                "id":2,
                "directions": [
                    "Mix the soy sauce, salt, cornstarch, and sherry in a large bowl.  Stir in chicken; cover and refrigerate.",
                    "Heat 1 1/2 cups of the peanut oil in a large, deep skillet.  Fry almonds in the oil until golden, about 1 minute. Drain fried almonds on a paper towel.",
                    "Drain all but 3 tablespoons of oil from the skillet.  Stir in the mushrooms, bamboo shoots, celery, onion, and water chestnuts. Cook and stir vegetables for 1 minute. Remove from skillet.",
                    "Heat 1/4 cup oil in the skillet. Cook and stir the marinated chicken in hot oil until no longer pink in the center, and the juices run clear, 3 to 5 minutes. Stir in cooked vegetables, chicken stock, and reserved soy sauce mixture; simmer until thickened, 1 to 2 minutes. Stir in fried almonds before serving."
                ],
                "ingredients": [
                    "3 tablespoons soy sauce",
                    "3/4 teaspoon salt",
                    "1 teaspoon cornstarch",
                    "2 teaspoons sherry",
                    "3 pounds chicken, skin removed, meat removed from bones and cut into bite sized pieces",
                    "1 1/2 cups peanut oil for frying",
                    "1 cup blanched almonds",
                    "1/3 cup sliced mushrooms",
                    "1/2 cup diagonally sliced bamboo shoots",
                    "1/2 cup diagonally sliced celery",
                    "1/4 cup thinly sliced onion",
                    "10 whole water chestnuts, thinly sliced",
                    "1/4 cup peanut oil",
                    "1/3 cup chicken stock"
                ],
                "language": "en-US",
                "source": "allrecipes.com",
                "tags": [],
                "title": "Chinese Almond Chicken",
                "image": "https://img.freepik.com/free-photo/high-angle-japanese-dumplings-composition_23-2148809869.jpg?w=900&t=st=1683119596~exp=1683120196~hmac=ef178e0d65ebab3d7eef498844e3becedeabab6d3b2661c033140555ac046e86"
            },
            {
                "id":3,
                "directions": [
                    "In a large bowl, blend hoisin sauce, cranberry sauce, soy sauce, white wine, honey, and red food coloring. Mix in garlic salt and Chinese five-spice powder. Place ribs in the mixture. Cover, and marinate in the refrigerator at least 1 hour.",
                    "Preheat oven to 350 degrees F (175 degrees C).",
                    "Place water in the bottom of a large roasting pan. Arrange ribs on pan rack, and cook 30 minutes in the preheated oven. Cover with remaining sauce mixture, and continue cooking 30 minutes, to an internal temperature of 160 degrees F (70 degrees C)."
                ],
                "ingredients": [
                    "1/2 cup hoisin sauce",
                    "1/4 cup jellied cranberry sauce",
                    "3 tablespoons reduced sodium soy sauce",
                    "2 tablespoons white wine",
                    "2 tablespoons honey",
                    "1/2 teaspoon red food coloring",
                    "1/2 teaspoon garlic salt",
                    "1/4 teaspoon Chinese five-spice powder",
                    "4 pounds pork spareribs, cut into 1-inch pieces",
                    "2 cups water"
                ],
                "language": "en-US",
                "source": "allrecipes.com",
                "tags": [],
                "title": "Chinese Barbequed Spareribs",
                "image": "https://img.freepik.com/premium-photo/chilli-paneer-dry-is-made-using-cottage-cheese-indo-chinese-food_466689-76969.jpg?w=900"
            }
        ]
    },
    {
        "id": "124e13b9-2d54-4b2f-a74d-a77b362d6eaf",
        "name": "Li Jun",
        "experience":7,
        "ratings": 4,
        "ratingsCount": 3725,
        "numberOfRecipe":12,
        "img": "../assets/chefs/6.jpg",
        "recipe":
        [
            {
                "id":1,
                "directions": [
                    "In a preheated 350 degree F oven (175 degree C), toast the crushed noodles and nuts until golden brown.",
                    "In a large bowl, combine the coleslaw, green onions, toasted ramen noodles and cashews.",
                    "To prepare the dressing, whisk together the sugar, oil, vinegar and soy sauce. Pour the dressing over the salad, toss and serve."
                ],
                "ingredients": [
                    "1 (3 ounce) package ramen noodles, crushed",
                    "10 ounces cashew pieces",
                    "1 (16 ounce) package shredded coleslaw mix",
                    "1 bunch green onions, chopped",
                    "1/2 cup white sugar",
                    "1/2 cup vegetable oil",
                    "1/4 cup cider vinegar",
                    "1 tablespoon soy sauce"
                ],
                "language": "en-US",
                "source": "allrecipes.com",
                "tags": [],
                "title": "Chinese Cabbage Salad I",
                "image": "https://img.freepik.com/free-photo/stir-fry-chicken-zucchini-sweet-peppers-green-onion-with-chopsticks_2829-10785.jpg?w=900&t=st=1683119607~exp=1683120207~hmac=a89fb208e3e8a960aee25dd69d5168af3a5a00b579b75cb4b95d09a1a5ec035a"
            },
            {
                "id":2,
                "directions": [
                    "In a small saucepan, cook the vinegar and sugar over medium heat until dissolved. Remove from heat and stir in salt, pepper, ramen seasoning packet and oil. Set aside to cool.",
                    "In a large bowl, combine the uncooked ramen noodles, broccoli coleslaw mix, and green onions. Pour dressing over salad; toss evenly to coat. Refrigerate until chilled.",
                    "Sprinkle with almonds and sesame seeds before serving."
                ],
                "ingredients": [
                    "3 tablespoons red wine vinegar",
                    "2 tablespoons white sugar",
                    "1/2 teaspoon salt",
                    "1/4 teaspoon ground black pepper",
                    "1 (3 ounce) package chicken flavored ramen noodles, crushed, seasoning packet reserved",
                    "1/2 cup vegetable oil",
                    "1 (16 ounce) package broccoli coleslaw mix",
                    "1/2 cup chopped green onions",
                    "4 ounces toasted slivered almonds",
                    "1/4 cup sesame seeds, toasted"
                ],
                "language": "en-US",
                "source": "allrecipes.com",
                "tags": [],
                "title": "Chinese Cabbage Salad II",
                "image": "https://img.freepik.com/free-photo/flat-lay-noodles-with-vegetables-chicken-with-chopsticks_23-2148377427.jpg?w=900&t=st=1683119612~exp=1683120212~hmac=c3732ea9b87633c9b1df91fd37c86bee6b404a1e1424d6ba06a77e88841162c1"
            },
            {
                "id":3,
                "directions": [
                    "In a small skillet, toast sesame seeds over medium heat until golden brown and fragrant.",
                    "In a small bowl, mix together vinegar, sesame oil, olive oil, sugar, salt, pepper, and ramen seasoning packet.",
                    "In a large bowl, mix together cabbage, carrots, and crushed ramen noodles. Toss with dressing to coat evenly.  Top with toasted sesame seeds."
                ],
                "ingredients": [
                    "2 tablespoons sesame seeds",
                    "1 1/2 tablespoons rice vinegar",
                    "1/2 teaspoon sesame oil",
                    "2 tablespoons white sugar",
                    "1/2 teaspoon salt",
                    "1/4 teaspoon black pepper",
                    "1/3 cup olive oil",
                    "4 cups shredded cabbage",
                    "2 carrots, shredded",
                    "1 (3 ounce) package ramen noodles, crushed"
                ],
                "language": "en-US",
                "source": "allrecipes.com",
                "tags": [],
                "title": "Chinese Cabbage Salad",
                "image": "https://img.freepik.com/premium-photo/schezwan-hakka-noodles-with-paneer-cottage-cheese-served-bowl-selective-focus_466689-32653.jpg?w=900"
            },
            {
                "id":3,
                "directions": [
                    "Mix butter, flour, and white sugar.   Spread in an 8 x 12 inch baking pan.",
                    "Bake in pre-heated oven at 325 degrees F (165 degrees C) for 15 minutes.",
                    "Beat eggs.  Add brown sugar, nuts and coconut.  Spread over baked crust.",
                    "Bake for another 30 minutes.    When completely cool, dust with confectioners' sugar."
                ],
                "image": "https://www.allrecipes.com/img/misc/og-default.png",
                "ingredients": [
                    "1 cup butter, softened",
                    "2 cups all-purpose flour",
                    "4 tablespoons white sugar",
                    "4  eggs",
                    "1 ½ cups packed brown sugar",
                    "1 cup chopped walnuts",
                    "½ cup flaked coconut"
                ],
                "language": "en-US",
                "source": "allrecipes.com",
                "tags": [],
                "title": "Chinese Chews II",
                "image": "https://img.freepik.com/premium-photo/chicken-hakka-schezwan-noodles-served-bowl-with-chopsticks-selective-focus_466689-34609.jpg?w=900"
            }
        ]
    },
    {
        "id": "124e13b9-2d54-4b2f-a74d-a77b362d6eag",
        "name": "Jia Li",
        "experience":7,
        "ratings": 4,
        "ratingsCount": 3725,
        "numberOfRecipe":12,
        "img": "../assets/chefs/7.jpg",
        "recipe":
        [
            {
                "id":1,
                "directions": [
                    "Remove and discard giblets and neck from chicken. Rinse chicken under cold running water; drain well and pat dry with paper towels. Pierce chicken thoroughly with fork. Place chicken, breast side up, in shallow, foil-lined roasting pan.",
                    "Combine lite soy sauce, sherry, oil, garlic, fennel, ginger, sugar and cloves. Brush cavity and skin thoroughly with sauce mixture.",
                    "Roast in 325 degrees F. oven 1 hour and 45 minutes, or until meat thermometer inserted into thigh registers 180, brushing chicken occasionally with remaining sauce mixture during last 40 minutes of roasting time.",
                    "Remove chicken from oven and let stand 10 minutes before carving."
                ],
                "ingredients": [
                    "1 (4 pound) fresh or thawed whole roasting chicken",
                    "2 tablespoons Kikkoman Lite Soy Sauce",
                    "2 teaspoons dry sherry",
                    "1 teaspoon vegetable oil",
                    "1 large clove garlic, pressed",
                    "1/2 teaspoon fennel seed, crushed",
                    "1/2 teaspoon ground ginger",
                    "1/4 teaspoon sugar",
                    "1/8 teaspoon ground cloves"
                ],
                "language": "en-US",
                "source": "allrecipes.com",
                "tags": [],
                "title": "Chinese Roasted Chicken",
                "image": "https://img.freepik.com/free-photo/beef-ball-fried-dark-wooden-surface_1150-43624.jpg?w=900&t=st=1683119626~exp=1683120226~hmac=892fa64c31af3f81eaa102418f3c180d1bdcfa0ba6e27f06326ad55d18ede046"
            },
            {
                "id":2,
                "directions": [
                    "Bring the rice and 4 cups of water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender, and the liquid has been absorbed, 20 to 25 minutes. Wash and soak the shittake mushrooms in 1 cup of hot water until softened, about 10 minutes. Slice the mushrooms and set aside, reserving liquid. Season the ground chicken with the soy sauce, sesame oil, and white pepper.",
                    "Heat the vegetable oil in a skillet over medium heat. Stir in the garlic and cook until fragrant. Toss in the ground chicken, mushroom, and sausages. Cook and stir until the chicken is crumbly, evenly browned, and no longer pink. Stir in the reserved mushroom liquid, dark soy sauce, green onions, and rice. Cook and stir until the rice is evenly coated with the sauce. Pour the eggs over the rice, stirring until the egg are no longer runny."
                ],
                "ingredients": [
                    "2 cups uncooked white rice",
                    "4 cups water",
                    "4 dried shiitake mushrooms",
                    "1 cup hot water",
                    "1/2 pound ground chicken",
                    "1 tablespoon soy sauce",
                    "1 teaspoon sesame oil",
                    "1 pinch white pepper",
                    "2 tablespoons vegetable oil",
                    "3 cloves garlic, sliced",
                    "2 links lop chong (Chinese-style sausage), thinly sliced",
                    "1 tablespoon dark soy sauce",
                    "4 green onions, chopped",
                    "2 eggs, lightly beaten"
                ],
                "language": "en-US",
                "source": "allrecipes.com",
                "tags": [],
                "title": "Chinese Sausage Fried Rice",
                "image": "https://img.freepik.com/free-photo/top-view-delicious-noodles-concept_23-2148773774.jpg?w=900&t=st=1683119631~exp=1683120231~hmac=2a4b587bafd11fe590719c082c088623081fddceaca3ea2db63e839808c59dae"
            },
            {
                "id":3,
                "directions": [
                    "Heat the oil in a large saucepan or wok over high heat.  Cook the garlic and ginger until fragrant and lightly browned.  Stir in the shrimp, and stir fry until cooked, then remove and set aside.  Pour in the chicken stock and bring to a boil.  Reduce heat to medium, add the tofu and peas, season with salt and pepper, then return to a simmer.  Mix the cornstarch with a little water to form a thin paste.  Stir the cornstarch into the soup and continue to simmer until clear and thickened, about 1 minute.  Stir the shrimp back into the soup and serve."
                ],
                "ingredients": [
                    "1 tablespoon vegetable oil",
                    "2 cloves garlic, minced",
                    "1 (1/2 inch) piece fresh ginger root, minced",
                    "6 ounces raw small shrimp, shelled and deveined",
                    "1 quart chicken stock",
                    "8 ounces tofu, diced small",
                    "1/3 cup frozen peas, thawed",
                    "1 teaspoon salt",
                    "1/2 teaspoon black pepper",
                    "1 tablespoon cornstarch"
                ],
                "language": "en-US",
                "source": "allrecipes.com",
                "tags": [],
                "title": "Chinese Shrimp and Tofu Soup",
                "image": "https://img.freepik.com/free-photo/tasty-asian-noodles-with-cheese-tofu-vegetables-bowls_1220-5312.jpg?w=900&t=st=1683119636~exp=1683120236~hmac=9009b8233af4a3e1d2bf72f762301f81f8206a638171e1b37ed11319b80dead1"
            },
            {
                "id":4,
                "directions": [
                    "In a large bowl, combine lychees, shrimp and apples. Stir in lemon juice and 1/4 cup reserved lychee juice. Let chill for 15 minutes.",
                    "Remove from refrigerator and drain liquid. Combine drained liquid with mayonnaise and toss together with fruit. Chill for at least another hour and serve cold."
                ],
                "ingredients": [
                    "1 (11 ounce) can lychee fruit, drained with juice reserved",
                    "1 pound cooked shrimp - peeled and deveined",
                    "3 Fuji apples - peeled, cored and cubed",
                    "1 tablespoon lemon juice",
                    "1/4 cup mayonnaise"
                ],
                "language": "en-US",
                "source": "allrecipes.com",
                "tags": [],
                "title": "Chinese Shrimp Salad",
                "image": "https://img.freepik.com/premium-photo/asian-noodles-with-prawns-vegetables-served-bowl-dark-background_1220-5659.jpg?w=900"
            },
            {
                "id":5,
                "directions": [
                    "Mix together the shrimp, chicken, egg, and cornstarch.",
                    "Heat 3 cups of the oil in wok. When it is hot, add shrimp and chicken mixture. Cook for 1/2 minute and drain.",
                    "Place above mixture in pot with the broth, mushroom, water chestnuts, bamboo shoots, and green beans. Bring to a boil. Add salt and sherry. Return to a boil. Reduce heat and allow to simmer.",
                    "Meanwhile, heat the remaining 1 cup of oil until it is hot. Add rice and brown quickly. Drain and add to soup. Serve and enjoy!"
                ],
                "ingredients": [
                    "3 ounces baby shrimp",
                    "3 ounces skinless, boneless chicken pieces cut into chunks",
                    "1 egg",
                    "4 tablespoons cornstarch",
                    "4 cups vegetable oil for frying",
                    "3 cups chicken broth",
                    "1 ounce mushrooms, chopped",
                    "2 tablespoons chopped water chestnuts",
                    "1/8 cup diced bamboo shoots",
                    "1/3 cup fresh green beans, cut into 1 inch pieces",
                    "1/2 teaspoon salt",
                    "1 tablespoon sherry",
                    "2/3 cup uncooked white rice"
                ],
                "language": "en-US",
                "source": "allrecipes.com",
                "tags": [],
                "title": "Chinese Sizzling Rice Soup",
                "image": "https://img.freepik.com/free-photo/thai-food-noodles-spicy-boil-with-seafood-pork-hot-pot_1150-27874.jpg?w=900&t=st=1683119644~exp=1683120244~hmac=923adc6f6990a790e273fa6a0bdee9163be6253868668abeb4c446f9df726e3b"
            }
        ]
    }
]